In [1]:
import pandas as pd

In [25]:
file_path = r'../source/raw.csv'
df = pd.read_csv(file_path, skipinitialspace=True)
df

     name  price author        date
0  Python  500.0   Paul  2022/11/22
1      na  450.0   John    2021/9/8
2   Swift -550.0     --    20220102
3      C#    NaN    NaN    2020-3-9
4   Swift -550.0     --    20220102
5  Python  600.0  Peter   2024-7-22
6      JS  450.0   Yoyo     1131102

In [8]:
print(type(df.loc[0, 'date']))

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [26]:
df.loc[6, 'date'] = str(int(df.loc[6, 'date'][0:3]) + 1911) + df.loc[6, 'date'][3:]
df.loc[6, 'date']

'20241102'

In [27]:
df['date'] = pd.to_datetime(df['date'], format="ISO8601")
df

     name  price author       date
0  Python  500.0   Paul 2022-11-22
1      na  450.0   John 2021-09-08
2   Swift -550.0     -- 2022-01-02
3      C#    NaN    NaN 2020-03-09
4   Swift -550.0     -- 2022-01-02
5  Python  600.0  Peter 2024-07-22
6      JS  450.0   Yoyo 2024-11-02